analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/clcd_regs.h
/**
 * @file    clcd_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the CLCD Peripheral Module.
 * @note    This file is @generated.
 * @ingroup clcd_registers
 */

/******************************************************************************
/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc. All Rights Reserved.
 * (now owned by Analog Devices, Inc.),
 * Copyright (C) 2023 Analog Devices, Inc. All Rights Reserved. This software
 * is proprietary to Analog Devices, Inc. and its licensors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_CLCD_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_CLCD_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     clcd
 * @defgroup    clcd_registers CLCD_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the CLCD Peripheral Module.
 * @details     Color LCD Controller
 */

/**
 * @ingroup clcd_registers
 * Structure type to access the CLCD Registers.
 */
typedef struct {
    __IO uint32_t clk_ctrl;             /**< <tt>\b 0x000:</tt> CLCD CLK_CTRL Register */
    __IO uint32_t vtim_0;               /**< <tt>\b 0x004:</tt> CLCD VTIM_0 Register */
    __IO uint32_t vtim_1;               /**< <tt>\b 0x008:</tt> CLCD VTIM_1 Register */
    __IO uint32_t htim;                 /**< <tt>\b 0x00C:</tt> CLCD HTIM Register */
    __IO uint32_t ctrl;                 /**< <tt>\b 0x010:</tt> CLCD CTRL Register */
    __R  uint32_t rsv_0x14;
    __IO uint32_t frbuf;                /**< <tt>\b 0x18:</tt> CLCD FRBUF Register */
    __R  uint32_t rsv_0x1c;
    __IO uint32_t int_en;               /**< <tt>\b 0x020:</tt> CLCD INT_EN Register */
    __IO uint32_t int_stat;             /**< <tt>\b 0x024:</tt> CLCD INT_STAT Register */
    __R  uint32_t rsv_0x28_0x3ff[246];
    __IO uint32_t palette_ram[256];     /**< <tt>\b 0x400:</tt> CLCD PALETTE_RAM Register */
} mxc_clcd_regs_t;

/* Register offsets for module CLCD */
/**
 * @ingroup    clcd_registers
 * @defgroup   CLCD_Register_Offsets Register Offsets
 * @brief      CLCD Peripheral Register Offsets from the CLCD Base Peripheral Address.
 * @{
 */
#define MXC_R_CLCD_CLK_CTRL                ((uint32_t)0x00000000UL) /**< Offset from CLCD Base Address: <tt> 0x0000</tt> */
#define MXC_R_CLCD_VTIM_0                  ((uint32_t)0x00000004UL) /**< Offset from CLCD Base Address: <tt> 0x0004</tt> */
#define MXC_R_CLCD_VTIM_1                  ((uint32_t)0x00000008UL) /**< Offset from CLCD Base Address: <tt> 0x0008</tt> */
#define MXC_R_CLCD_HTIM                    ((uint32_t)0x0000000CUL) /**< Offset from CLCD Base Address: <tt> 0x000C</tt> */
#define MXC_R_CLCD_CTRL                    ((uint32_t)0x00000010UL) /**< Offset from CLCD Base Address: <tt> 0x0010</tt> */
#define MXC_R_CLCD_FRBUF                   ((uint32_t)0x00000018UL) /**< Offset from CLCD Base Address: <tt> 0x0018</tt> */
#define MXC_R_CLCD_INT_EN                  ((uint32_t)0x00000020UL) /**< Offset from CLCD Base Address: <tt> 0x0020</tt> */
#define MXC_R_CLCD_INT_STAT                ((uint32_t)0x00000024UL) /**< Offset from CLCD Base Address: <tt> 0x0024</tt> */
#define MXC_R_CLCD_PALETTE_RAM             ((uint32_t)0x00000400UL) /**< Offset from CLCD Base Address: <tt> 0x0400</tt> */
/**@} end of group clcd_registers */

/**
 * @ingroup  clcd_registers
 * @defgroup CLCD_CLK_CTRL CLCD_CLK_CTRL
 * @brief    LCD Clock Control Register
 * @{
 */
#define MXC_F_CLCD_CLK_CTRL_LCD_CLKDIV_POS             0 /**< CLK_CTRL_LCD_CLKDIV Position */
#define MXC_F_CLCD_CLK_CTRL_LCD_CLKDIV                 ((uint32_t)(0xFFUL << MXC_F_CLCD_CLK_CTRL_LCD_CLKDIV_POS)) /**< CLK_CTRL_LCD_CLKDIV Mask */

#define MXC_F_CLCD_CLK_CTRL_STN_AC_BIAS_POS            8 /**< CLK_CTRL_STN_AC_BIAS Position */
#define MXC_F_CLCD_CLK_CTRL_STN_AC_BIAS                ((uint32_t)(0xFFUL << MXC_F_CLCD_CLK_CTRL_STN_AC_BIAS_POS)) /**< CLK_CTRL_STN_AC_BIAS Mask */

#define MXC_F_CLCD_CLK_CTRL_VDEN_POL_POS               16 /**< CLK_CTRL_VDEN_POL Position */
#define MXC_F_CLCD_CLK_CTRL_VDEN_POL                   ((uint32_t)(0x1UL << MXC_F_CLCD_CLK_CTRL_VDEN_POL_POS)) /**< CLK_CTRL_VDEN_POL Mask */
#define MXC_V_CLCD_CLK_CTRL_VDEN_POL_ACTIVELO          ((uint32_t)0x0UL) /**< CLK_CTRL_VDEN_POL_ACTIVELO Value */
#define MXC_S_CLCD_CLK_CTRL_VDEN_POL_ACTIVELO          (MXC_V_CLCD_CLK_CTRL_VDEN_POL_ACTIVELO << MXC_F_CLCD_CLK_CTRL_VDEN_POL_POS) /**< CLK_CTRL_VDEN_POL_ACTIVELO Setting */
#define MXC_V_CLCD_CLK_CTRL_VDEN_POL_ACTIVEHI          ((uint32_t)0x1UL) /**< CLK_CTRL_VDEN_POL_ACTIVEHI Value */
#define MXC_S_CLCD_CLK_CTRL_VDEN_POL_ACTIVEHI          (MXC_V_CLCD_CLK_CTRL_VDEN_POL_ACTIVEHI << MXC_F_CLCD_CLK_CTRL_VDEN_POL_POS) /**< CLK_CTRL_VDEN_POL_ACTIVEHI Setting */

#define MXC_F_CLCD_CLK_CTRL_VSYNC_POL_POS              17 /**< CLK_CTRL_VSYNC_POL Position */
#define MXC_F_CLCD_CLK_CTRL_VSYNC_POL                  ((uint32_t)(0x1UL << MXC_F_CLCD_CLK_CTRL_VSYNC_POL_POS)) /**< CLK_CTRL_VSYNC_POL Mask */
#define MXC_V_CLCD_CLK_CTRL_VSYNC_POL_ACTIVELO         ((uint32_t)0x0UL) /**< CLK_CTRL_VSYNC_POL_ACTIVELO Value */
#define MXC_S_CLCD_CLK_CTRL_VSYNC_POL_ACTIVELO         (MXC_V_CLCD_CLK_CTRL_VSYNC_POL_ACTIVELO << MXC_F_CLCD_CLK_CTRL_VSYNC_POL_POS) /**< CLK_CTRL_VSYNC_POL_ACTIVELO Setting */
#define MXC_V_CLCD_CLK_CTRL_VSYNC_POL_ACTIVEHI         ((uint32_t)0x1UL) /**< CLK_CTRL_VSYNC_POL_ACTIVEHI Value */
#define MXC_S_CLCD_CLK_CTRL_VSYNC_POL_ACTIVEHI         (MXC_V_CLCD_CLK_CTRL_VSYNC_POL_ACTIVEHI << MXC_F_CLCD_CLK_CTRL_VSYNC_POL_POS) /**< CLK_CTRL_VSYNC_POL_ACTIVEHI Setting */

#define MXC_F_CLCD_CLK_CTRL_HSYNC_POL_POS              18 /**< CLK_CTRL_HSYNC_POL Position */
#define MXC_F_CLCD_CLK_CTRL_HSYNC_POL                  ((uint32_t)(0x1UL << MXC_F_CLCD_CLK_CTRL_HSYNC_POL_POS)) /**< CLK_CTRL_HSYNC_POL Mask */
#define MXC_V_CLCD_CLK_CTRL_HSYNC_POL_ACTIVELO         ((uint32_t)0x0UL) /**< CLK_CTRL_HSYNC_POL_ACTIVELO Value */
#define MXC_S_CLCD_CLK_CTRL_HSYNC_POL_ACTIVELO         (MXC_V_CLCD_CLK_CTRL_HSYNC_POL_ACTIVELO << MXC_F_CLCD_CLK_CTRL_HSYNC_POL_POS) /**< CLK_CTRL_HSYNC_POL_ACTIVELO Setting */
#define MXC_V_CLCD_CLK_CTRL_HSYNC_POL_ACTIVEHI         ((uint32_t)0x1UL) /**< CLK_CTRL_HSYNC_POL_ACTIVEHI Value */
#define MXC_S_CLCD_CLK_CTRL_HSYNC_POL_ACTIVEHI         (MXC_V_CLCD_CLK_CTRL_HSYNC_POL_ACTIVEHI << MXC_F_CLCD_CLK_CTRL_HSYNC_POL_POS) /**< CLK_CTRL_HSYNC_POL_ACTIVEHI Setting */

#define MXC_F_CLCD_CLK_CTRL_CLK_EDGE_SEL_POS           19 /**< CLK_CTRL_CLK_EDGE_SEL Position */
#define MXC_F_CLCD_CLK_CTRL_CLK_EDGE_SEL               ((uint32_t)(0x1UL << MXC_F_CLCD_CLK_CTRL_CLK_EDGE_SEL_POS)) /**< CLK_CTRL_CLK_EDGE_SEL Mask */
#define MXC_V_CLCD_CLK_CTRL_CLK_EDGE_SEL_RISING        ((uint32_t)0x0UL) /**< CLK_CTRL_CLK_EDGE_SEL_RISING Value */
#define MXC_S_CLCD_CLK_CTRL_CLK_EDGE_SEL_RISING        (MXC_V_CLCD_CLK_CTRL_CLK_EDGE_SEL_RISING << MXC_F_CLCD_CLK_CTRL_CLK_EDGE_SEL_POS) /**< CLK_CTRL_CLK_EDGE_SEL_RISING Setting */
#define MXC_V_CLCD_CLK_CTRL_CLK_EDGE_SEL_FALLING       ((uint32_t)0x1UL) /**< CLK_CTRL_CLK_EDGE_SEL_FALLING Value */
#define MXC_S_CLCD_CLK_CTRL_CLK_EDGE_SEL_FALLING       (MXC_V_CLCD_CLK_CTRL_CLK_EDGE_SEL_FALLING << MXC_F_CLCD_CLK_CTRL_CLK_EDGE_SEL_POS) /**< CLK_CTRL_CLK_EDGE_SEL_FALLING Setting */

#define MXC_F_CLCD_CLK_CTRL_CLK_ACTIVE_POS             20 /**< CLK_CTRL_CLK_ACTIVE Position */
#define MXC_F_CLCD_CLK_CTRL_CLK_ACTIVE                 ((uint32_t)(0x1UL << MXC_F_CLCD_CLK_CTRL_CLK_ACTIVE_POS)) /**< CLK_CTRL_CLK_ACTIVE Mask */
#define MXC_V_CLCD_CLK_CTRL_CLK_ACTIVE_ALWAYS          ((uint32_t)0x0UL) /**< CLK_CTRL_CLK_ACTIVE_ALWAYS Value */
#define MXC_S_CLCD_CLK_CTRL_CLK_ACTIVE_ALWAYS          (MXC_V_CLCD_CLK_CTRL_CLK_ACTIVE_ALWAYS << MXC_F_CLCD_CLK_CTRL_CLK_ACTIVE_POS) /**< CLK_CTRL_CLK_ACTIVE_ALWAYS Setting */
#define MXC_V_CLCD_CLK_CTRL_CLK_ACTIVE_ONDATA          ((uint32_t)0x1UL) /**< CLK_CTRL_CLK_ACTIVE_ONDATA Value */
#define MXC_S_CLCD_CLK_CTRL_CLK_ACTIVE_ONDATA          (MXC_V_CLCD_CLK_CTRL_CLK_ACTIVE_ONDATA << MXC_F_CLCD_CLK_CTRL_CLK_ACTIVE_POS) /**< CLK_CTRL_CLK_ACTIVE_ONDATA Setting */

/**@} end of group CLCD_CLK_CTRL_Register */

/**
 * @ingroup  clcd_registers
 * @defgroup CLCD_VTIM_0 CLCD_VTIM_0
 * @brief    LCD Vertical Timing 0 Register
 * @{
 */
#define MXC_F_CLCD_VTIM_0_VLINES_POS                   0 /**< VTIM_0_VLINES Position */
#define MXC_F_CLCD_VTIM_0_VLINES                       ((uint32_t)(0xFFUL << MXC_F_CLCD_VTIM_0_VLINES_POS)) /**< VTIM_0_VLINES Mask */

#define MXC_F_CLCD_VTIM_0_VBP_WIDTH_POS                16 /**< VTIM_0_VBP_WIDTH Position */
#define MXC_F_CLCD_VTIM_0_VBP_WIDTH                    ((uint32_t)(0xFFUL << MXC_F_CLCD_VTIM_0_VBP_WIDTH_POS)) /**< VTIM_0_VBP_WIDTH Mask */

/**@} end of group CLCD_VTIM_0_Register */

/**
 * @ingroup  clcd_registers
 * @defgroup CLCD_VTIM_1 CLCD_VTIM_1
 * @brief    LCD Vertical Timing 1 Register
 * @{
 */
#define MXC_F_CLCD_VTIM_1_VSYNC_WIDTH_POS              0 /**< VTIM_1_VSYNC_WIDTH Position */
#define MXC_F_CLCD_VTIM_1_VSYNC_WIDTH                  ((uint32_t)(0xFFUL << MXC_F_CLCD_VTIM_1_VSYNC_WIDTH_POS)) /**< VTIM_1_VSYNC_WIDTH Mask */

#define MXC_F_CLCD_VTIM_1_VFP_WIDTH_POS                16 /**< VTIM_1_VFP_WIDTH Position */
#define MXC_F_CLCD_VTIM_1_VFP_WIDTH                    ((uint32_t)(0xFFUL << MXC_F_CLCD_VTIM_1_VFP_WIDTH_POS)) /**< VTIM_1_VFP_WIDTH Mask */

/**@} end of group CLCD_VTIM_1_Register */

/**
 * @ingroup  clcd_registers
 * @defgroup CLCD_HTIM CLCD_HTIM
 * @brief    LCD Horizontal Timing Register.
 * @{
 */
#define MXC_F_CLCD_HTIM_HSYNC_WIDTH_POS                0 /**< HTIM_HSYNC_WIDTH Position */
#define MXC_F_CLCD_HTIM_HSYNC_WIDTH                    ((uint32_t)(0xFFUL << MXC_F_CLCD_HTIM_HSYNC_WIDTH_POS)) /**< HTIM_HSYNC_WIDTH Mask */

#define MXC_F_CLCD_HTIM_HFP_WIDTH_POS                  8 /**< HTIM_HFP_WIDTH Position */
#define MXC_F_CLCD_HTIM_HFP_WIDTH                      ((uint32_t)(0xFFUL << MXC_F_CLCD_HTIM_HFP_WIDTH_POS)) /**< HTIM_HFP_WIDTH Mask */

#define MXC_F_CLCD_HTIM_HSIZE_INDEX_POS                16 /**< HTIM_HSIZE_INDEX Position */
#define MXC_F_CLCD_HTIM_HSIZE_INDEX                    ((uint32_t)(0xFFUL << MXC_F_CLCD_HTIM_HSIZE_INDEX_POS)) /**< HTIM_HSIZE_INDEX Mask */

