analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/clcd_regs.h
#define MXC_F_CLCD_CTRL_COMPACT_24B_POS                15 /**< CTRL_COMPACT_24B Position */
#define MXC_F_CLCD_CTRL_COMPACT_24B                    ((uint32_t)(0x1UL << MXC_F_CLCD_CTRL_COMPACT_24B_POS)) /**< CTRL_COMPACT_24B Mask */
#define MXC_V_CLCD_CTRL_COMPACT_24B_1_PFR              ((uint32_t)0x0UL) /**< CTRL_COMPACT_24B_1_PFR Value */
#define MXC_S_CLCD_CTRL_COMPACT_24B_1_PFR              (MXC_V_CLCD_CTRL_COMPACT_24B_1_PFR << MXC_F_CLCD_CTRL_COMPACT_24B_POS) /**< CTRL_COMPACT_24B_1_PFR Setting */
#define MXC_V_CLCD_CTRL_COMPACT_24B_1ANDA3RD_PFR       ((uint32_t)0x1UL) /**< CTRL_COMPACT_24B_1ANDA3RD_PFR Value */
#define MXC_S_CLCD_CTRL_COMPACT_24B_1ANDA3RD_PFR       (MXC_V_CLCD_CTRL_COMPACT_24B_1ANDA3RD_PFR << MXC_F_CLCD_CTRL_COMPACT_24B_POS) /**< CTRL_COMPACT_24B_1ANDA3RD_PFR Setting */

#define MXC_F_CLCD_CTRL_BURST_SIZE_POS                 19 /**< CTRL_BURST_SIZE Position */
#define MXC_F_CLCD_CTRL_BURST_SIZE                     ((uint32_t)(0x3UL << MXC_F_CLCD_CTRL_BURST_SIZE_POS)) /**< CTRL_BURST_SIZE Mask */
#define MXC_V_CLCD_CTRL_BURST_SIZE_4WORDS              ((uint32_t)0x0UL) /**< CTRL_BURST_SIZE_4WORDS Value */
#define MXC_S_CLCD_CTRL_BURST_SIZE_4WORDS              (MXC_V_CLCD_CTRL_BURST_SIZE_4WORDS << MXC_F_CLCD_CTRL_BURST_SIZE_POS) /**< CTRL_BURST_SIZE_4WORDS Setting */
#define MXC_V_CLCD_CTRL_BURST_SIZE_8WORDS              ((uint32_t)0x1UL) /**< CTRL_BURST_SIZE_8WORDS Value */
#define MXC_S_CLCD_CTRL_BURST_SIZE_8WORDS              (MXC_V_CLCD_CTRL_BURST_SIZE_8WORDS << MXC_F_CLCD_CTRL_BURST_SIZE_POS) /**< CTRL_BURST_SIZE_8WORDS Setting */
#define MXC_V_CLCD_CTRL_BURST_SIZE_16WORDS             ((uint32_t)0x2UL) /**< CTRL_BURST_SIZE_16WORDS Value */
#define MXC_S_CLCD_CTRL_BURST_SIZE_16WORDS             (MXC_V_CLCD_CTRL_BURST_SIZE_16WORDS << MXC_F_CLCD_CTRL_BURST_SIZE_POS) /**< CTRL_BURST_SIZE_16WORDS Setting */

#define MXC_F_CLCD_CTRL_LEND_POL_POS                   21 /**< CTRL_LEND_POL Position */
#define MXC_F_CLCD_CTRL_LEND_POL                       ((uint32_t)(0x1UL << MXC_F_CLCD_CTRL_LEND_POL_POS)) /**< CTRL_LEND_POL Mask */
#define MXC_V_CLCD_CTRL_LEND_POL_ACTIVELO              ((uint32_t)0x0UL) /**< CTRL_LEND_POL_ACTIVELO Value */
#define MXC_S_CLCD_CTRL_LEND_POL_ACTIVELO              (MXC_V_CLCD_CTRL_LEND_POL_ACTIVELO << MXC_F_CLCD_CTRL_LEND_POL_POS) /**< CTRL_LEND_POL_ACTIVELO Setting */
#define MXC_V_CLCD_CTRL_LEND_POL_ACTIVEHI              ((uint32_t)0x1UL) /**< CTRL_LEND_POL_ACTIVEHI Value */
#define MXC_S_CLCD_CTRL_LEND_POL_ACTIVEHI              (MXC_V_CLCD_CTRL_LEND_POL_ACTIVEHI << MXC_F_CLCD_CTRL_LEND_POL_POS) /**< CTRL_LEND_POL_ACTIVEHI Setting */

#define MXC_F_CLCD_CTRL_PWR_ENABLE_POS                 22 /**< CTRL_PWR_ENABLE Position */
#define MXC_F_CLCD_CTRL_PWR_ENABLE                     ((uint32_t)(0x1UL << MXC_F_CLCD_CTRL_PWR_ENABLE_POS)) /**< CTRL_PWR_ENABLE Mask */
#define MXC_V_CLCD_CTRL_PWR_ENABLE_LO                  ((uint32_t)0x0UL) /**< CTRL_PWR_ENABLE_LO Value */
#define MXC_S_CLCD_CTRL_PWR_ENABLE_LO                  (MXC_V_CLCD_CTRL_PWR_ENABLE_LO << MXC_F_CLCD_CTRL_PWR_ENABLE_POS) /**< CTRL_PWR_ENABLE_LO Setting */
#define MXC_V_CLCD_CTRL_PWR_ENABLE_HI                  ((uint32_t)0x1UL) /**< CTRL_PWR_ENABLE_HI Value */
#define MXC_S_CLCD_CTRL_PWR_ENABLE_HI                  (MXC_V_CLCD_CTRL_PWR_ENABLE_HI << MXC_F_CLCD_CTRL_PWR_ENABLE_POS) /**< CTRL_PWR_ENABLE_HI Setting */

/**@} end of group CLCD_CTRL_Register */

/**
 * @ingroup  clcd_registers
 * @defgroup CLCD_FRBUF CLCD_FRBUF
 * @brief    Frame buffer.
 * @{
 */
#define MXC_F_CLCD_FRBUF_FRAME_ADDR_POS                0 /**< FRBUF_FRAME_ADDR Position */
#define MXC_F_CLCD_FRBUF_FRAME_ADDR                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_CLCD_FRBUF_FRAME_ADDR_POS)) /**< FRBUF_FRAME_ADDR Mask */

/**@} end of group CLCD_FRBUF_Register */

/**
 * @ingroup  clcd_registers
 * @defgroup CLCD_INT_EN CLCD_INT_EN
 * @brief    LCD Interrupt Enable Register.
 * @{
 */
#define MXC_F_CLCD_INT_EN_UNDERFLOW_IE_POS             0 /**< INT_EN_UNDERFLOW_IE Position */
#define MXC_F_CLCD_INT_EN_UNDERFLOW_IE                 ((uint32_t)(0x1UL << MXC_F_CLCD_INT_EN_UNDERFLOW_IE_POS)) /**< INT_EN_UNDERFLOW_IE Mask */
#define MXC_V_CLCD_INT_EN_UNDERFLOW_IE_DIS             ((uint32_t)0x0UL) /**< INT_EN_UNDERFLOW_IE_DIS Value */
#define MXC_S_CLCD_INT_EN_UNDERFLOW_IE_DIS             (MXC_V_CLCD_INT_EN_UNDERFLOW_IE_DIS << MXC_F_CLCD_INT_EN_UNDERFLOW_IE_POS) /**< INT_EN_UNDERFLOW_IE_DIS Setting */
#define MXC_V_CLCD_INT_EN_UNDERFLOW_IE_EN              ((uint32_t)0x1UL) /**< INT_EN_UNDERFLOW_IE_EN Value */
#define MXC_S_CLCD_INT_EN_UNDERFLOW_IE_EN              (MXC_V_CLCD_INT_EN_UNDERFLOW_IE_EN << MXC_F_CLCD_INT_EN_UNDERFLOW_IE_POS) /**< INT_EN_UNDERFLOW_IE_EN Setting */

#define MXC_F_CLCD_INT_EN_ADDR_RDY_IE_POS              1 /**< INT_EN_ADDR_RDY_IE Position */
#define MXC_F_CLCD_INT_EN_ADDR_RDY_IE                  ((uint32_t)(0x1UL << MXC_F_CLCD_INT_EN_ADDR_RDY_IE_POS)) /**< INT_EN_ADDR_RDY_IE Mask */
#define MXC_V_CLCD_INT_EN_ADDR_RDY_IE_DIS              ((uint32_t)0x0UL) /**< INT_EN_ADDR_RDY_IE_DIS Value */
#define MXC_S_CLCD_INT_EN_ADDR_RDY_IE_DIS              (MXC_V_CLCD_INT_EN_ADDR_RDY_IE_DIS << MXC_F_CLCD_INT_EN_ADDR_RDY_IE_POS) /**< INT_EN_ADDR_RDY_IE_DIS Setting */
#define MXC_V_CLCD_INT_EN_ADDR_RDY_IE_EN               ((uint32_t)0x1UL) /**< INT_EN_ADDR_RDY_IE_EN Value */
#define MXC_S_CLCD_INT_EN_ADDR_RDY_IE_EN               (MXC_V_CLCD_INT_EN_ADDR_RDY_IE_EN << MXC_F_CLCD_INT_EN_ADDR_RDY_IE_POS) /**< INT_EN_ADDR_RDY_IE_EN Setting */

#define MXC_F_CLCD_INT_EN_VCI_IE_POS                   2 /**< INT_EN_VCI_IE Position */
#define MXC_F_CLCD_INT_EN_VCI_IE                       ((uint32_t)(0x1UL << MXC_F_CLCD_INT_EN_VCI_IE_POS)) /**< INT_EN_VCI_IE Mask */
#define MXC_V_CLCD_INT_EN_VCI_IE_DIS                   ((uint32_t)0x0UL) /**< INT_EN_VCI_IE_DIS Value */
#define MXC_S_CLCD_INT_EN_VCI_IE_DIS                   (MXC_V_CLCD_INT_EN_VCI_IE_DIS << MXC_F_CLCD_INT_EN_VCI_IE_POS) /**< INT_EN_VCI_IE_DIS Setting */
#define MXC_V_CLCD_INT_EN_VCI_IE_EN                    ((uint32_t)0x1UL) /**< INT_EN_VCI_IE_EN Value */
#define MXC_S_CLCD_INT_EN_VCI_IE_EN                    (MXC_V_CLCD_INT_EN_VCI_IE_EN << MXC_F_CLCD_INT_EN_VCI_IE_POS) /**< INT_EN_VCI_IE_EN Setting */

#define MXC_F_CLCD_INT_EN_BUS_ERROR_IE_POS             3 /**< INT_EN_BUS_ERROR_IE Position */
#define MXC_F_CLCD_INT_EN_BUS_ERROR_IE                 ((uint32_t)(0x1UL << MXC_F_CLCD_INT_EN_BUS_ERROR_IE_POS)) /**< INT_EN_BUS_ERROR_IE Mask */
#define MXC_V_CLCD_INT_EN_BUS_ERROR_IE_DIS             ((uint32_t)0x0UL) /**< INT_EN_BUS_ERROR_IE_DIS Value */
#define MXC_S_CLCD_INT_EN_BUS_ERROR_IE_DIS             (MXC_V_CLCD_INT_EN_BUS_ERROR_IE_DIS << MXC_F_CLCD_INT_EN_BUS_ERROR_IE_POS) /**< INT_EN_BUS_ERROR_IE_DIS Setting */
#define MXC_V_CLCD_INT_EN_BUS_ERROR_IE_EN              ((uint32_t)0x1UL) /**< INT_EN_BUS_ERROR_IE_EN Value */
#define MXC_S_CLCD_INT_EN_BUS_ERROR_IE_EN              (MXC_V_CLCD_INT_EN_BUS_ERROR_IE_EN << MXC_F_CLCD_INT_EN_BUS_ERROR_IE_POS) /**< INT_EN_BUS_ERROR_IE_EN Setting */

/**@} end of group CLCD_INT_EN_Register */

/**
 * @ingroup  clcd_registers
 * @defgroup CLCD_INT_STAT CLCD_INT_STAT
 * @brief    LCD Status Register.
 * @{
 */
#define MXC_F_CLCD_INT_STAT_UNDERFLOW_POS              0 /**< INT_STAT_UNDERFLOW Position */
#define MXC_F_CLCD_INT_STAT_UNDERFLOW                  ((uint32_t)(0x1UL << MXC_F_CLCD_INT_STAT_UNDERFLOW_POS)) /**< INT_STAT_UNDERFLOW Mask */
#define MXC_V_CLCD_INT_STAT_UNDERFLOW_INACTIVE         ((uint32_t)0x0UL) /**< INT_STAT_UNDERFLOW_INACTIVE Value */
#define MXC_S_CLCD_INT_STAT_UNDERFLOW_INACTIVE         (MXC_V_CLCD_INT_STAT_UNDERFLOW_INACTIVE << MXC_F_CLCD_INT_STAT_UNDERFLOW_POS) /**< INT_STAT_UNDERFLOW_INACTIVE Setting */
#define MXC_V_CLCD_INT_STAT_UNDERFLOW_PEND             ((uint32_t)0x1UL) /**< INT_STAT_UNDERFLOW_PEND Value */
#define MXC_S_CLCD_INT_STAT_UNDERFLOW_PEND             (MXC_V_CLCD_INT_STAT_UNDERFLOW_PEND << MXC_F_CLCD_INT_STAT_UNDERFLOW_POS) /**< INT_STAT_UNDERFLOW_PEND Setting */
#define MXC_V_CLCD_INT_STAT_UNDERFLOW_CLEAR            ((uint32_t)0x1UL) /**< INT_STAT_UNDERFLOW_CLEAR Value */
#define MXC_S_CLCD_INT_STAT_UNDERFLOW_CLEAR            (MXC_V_CLCD_INT_STAT_UNDERFLOW_CLEAR << MXC_F_CLCD_INT_STAT_UNDERFLOW_POS) /**< INT_STAT_UNDERFLOW_CLEAR Setting */

#define MXC_F_CLCD_INT_STAT_ADDR_RDY_POS               1 /**< INT_STAT_ADDR_RDY Position */
#define MXC_F_CLCD_INT_STAT_ADDR_RDY                   ((uint32_t)(0x1UL << MXC_F_CLCD_INT_STAT_ADDR_RDY_POS)) /**< INT_STAT_ADDR_RDY Mask */
#define MXC_V_CLCD_INT_STAT_ADDR_RDY_INACTIVE          ((uint32_t)0x0UL) /**< INT_STAT_ADDR_RDY_INACTIVE Value */
#define MXC_S_CLCD_INT_STAT_ADDR_RDY_INACTIVE          (MXC_V_CLCD_INT_STAT_ADDR_RDY_INACTIVE << MXC_F_CLCD_INT_STAT_ADDR_RDY_POS) /**< INT_STAT_ADDR_RDY_INACTIVE Setting */
#define MXC_V_CLCD_INT_STAT_ADDR_RDY_PEND              ((uint32_t)0x1UL) /**< INT_STAT_ADDR_RDY_PEND Value */
#define MXC_S_CLCD_INT_STAT_ADDR_RDY_PEND              (MXC_V_CLCD_INT_STAT_ADDR_RDY_PEND << MXC_F_CLCD_INT_STAT_ADDR_RDY_POS) /**< INT_STAT_ADDR_RDY_PEND Setting */
#define MXC_V_CLCD_INT_STAT_ADDR_RDY_CLEAR             ((uint32_t)0x1UL) /**< INT_STAT_ADDR_RDY_CLEAR Value */
#define MXC_S_CLCD_INT_STAT_ADDR_RDY_CLEAR             (MXC_V_CLCD_INT_STAT_ADDR_RDY_CLEAR << MXC_F_CLCD_INT_STAT_ADDR_RDY_POS) /**< INT_STAT_ADDR_RDY_CLEAR Setting */

