analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/clcd_regs.h
#define MXC_F_CLCD_INT_STAT_VCI_POS                    2 /**< INT_STAT_VCI Position */
#define MXC_F_CLCD_INT_STAT_VCI                        ((uint32_t)(0x1UL << MXC_F_CLCD_INT_STAT_VCI_POS)) /**< INT_STAT_VCI Mask */
#define MXC_V_CLCD_INT_STAT_VCI_INACTIVE               ((uint32_t)0x0UL) /**< INT_STAT_VCI_INACTIVE Value */
#define MXC_S_CLCD_INT_STAT_VCI_INACTIVE               (MXC_V_CLCD_INT_STAT_VCI_INACTIVE << MXC_F_CLCD_INT_STAT_VCI_POS) /**< INT_STAT_VCI_INACTIVE Setting */
#define MXC_V_CLCD_INT_STAT_VCI_PEND                   ((uint32_t)0x1UL) /**< INT_STAT_VCI_PEND Value */
#define MXC_S_CLCD_INT_STAT_VCI_PEND                   (MXC_V_CLCD_INT_STAT_VCI_PEND << MXC_F_CLCD_INT_STAT_VCI_POS) /**< INT_STAT_VCI_PEND Setting */
#define MXC_V_CLCD_INT_STAT_VCI_CLEAR                  ((uint32_t)0x1UL) /**< INT_STAT_VCI_CLEAR Value */
#define MXC_S_CLCD_INT_STAT_VCI_CLEAR                  (MXC_V_CLCD_INT_STAT_VCI_CLEAR << MXC_F_CLCD_INT_STAT_VCI_POS) /**< INT_STAT_VCI_CLEAR Setting */

#define MXC_F_CLCD_INT_STAT_BUS_ERROR_POS              3 /**< INT_STAT_BUS_ERROR Position */
#define MXC_F_CLCD_INT_STAT_BUS_ERROR                  ((uint32_t)(0x1UL << MXC_F_CLCD_INT_STAT_BUS_ERROR_POS)) /**< INT_STAT_BUS_ERROR Mask */
#define MXC_V_CLCD_INT_STAT_BUS_ERROR_INACTIVE         ((uint32_t)0x0UL) /**< INT_STAT_BUS_ERROR_INACTIVE Value */
#define MXC_S_CLCD_INT_STAT_BUS_ERROR_INACTIVE         (MXC_V_CLCD_INT_STAT_BUS_ERROR_INACTIVE << MXC_F_CLCD_INT_STAT_BUS_ERROR_POS) /**< INT_STAT_BUS_ERROR_INACTIVE Setting */
#define MXC_V_CLCD_INT_STAT_BUS_ERROR_PEND             ((uint32_t)0x1UL) /**< INT_STAT_BUS_ERROR_PEND Value */
#define MXC_S_CLCD_INT_STAT_BUS_ERROR_PEND             (MXC_V_CLCD_INT_STAT_BUS_ERROR_PEND << MXC_F_CLCD_INT_STAT_BUS_ERROR_POS) /**< INT_STAT_BUS_ERROR_PEND Setting */
#define MXC_V_CLCD_INT_STAT_BUS_ERROR_CLEAR            ((uint32_t)0x1UL) /**< INT_STAT_BUS_ERROR_CLEAR Value */
#define MXC_S_CLCD_INT_STAT_BUS_ERROR_CLEAR            (MXC_V_CLCD_INT_STAT_BUS_ERROR_CLEAR << MXC_F_CLCD_INT_STAT_BUS_ERROR_POS) /**< INT_STAT_BUS_ERROR_CLEAR Setting */

#define MXC_F_CLCD_INT_STAT_CLCD_IDLE_POS              8 /**< INT_STAT_CLCD_IDLE Position */
#define MXC_F_CLCD_INT_STAT_CLCD_IDLE                  ((uint32_t)(0x1UL << MXC_F_CLCD_INT_STAT_CLCD_IDLE_POS)) /**< INT_STAT_CLCD_IDLE Mask */
#define MXC_V_CLCD_INT_STAT_CLCD_IDLE_IDLE             ((uint32_t)0x0UL) /**< INT_STAT_CLCD_IDLE_IDLE Value */
#define MXC_S_CLCD_INT_STAT_CLCD_IDLE_IDLE             (MXC_V_CLCD_INT_STAT_CLCD_IDLE_IDLE << MXC_F_CLCD_INT_STAT_CLCD_IDLE_POS) /**< INT_STAT_CLCD_IDLE_IDLE Setting */
#define MXC_V_CLCD_INT_STAT_CLCD_IDLE_BUSY             ((uint32_t)0x1UL) /**< INT_STAT_CLCD_IDLE_BUSY Value */
#define MXC_S_CLCD_INT_STAT_CLCD_IDLE_BUSY             (MXC_V_CLCD_INT_STAT_CLCD_IDLE_BUSY << MXC_F_CLCD_INT_STAT_CLCD_IDLE_POS) /**< INT_STAT_CLCD_IDLE_BUSY Setting */

/**@} end of group CLCD_INT_STAT_Register */

/**
 * @ingroup  clcd_registers
 * @defgroup CLCD_PALETTE_RAM CLCD_PALETTE_RAM
 * @brief    Palette
 * @{
 */
#define MXC_F_CLCD_PALETTE_RAM_RED_POS                 0 /**< PALETTE_RAM_RED Position */
#define MXC_F_CLCD_PALETTE_RAM_RED                     ((uint32_t)(0xFFUL << MXC_F_CLCD_PALETTE_RAM_RED_POS)) /**< PALETTE_RAM_RED Mask */

#define MXC_F_CLCD_PALETTE_RAM_GREEN_POS               8 /**< PALETTE_RAM_GREEN Position */
#define MXC_F_CLCD_PALETTE_RAM_GREEN                   ((uint32_t)(0xFFUL << MXC_F_CLCD_PALETTE_RAM_GREEN_POS)) /**< PALETTE_RAM_GREEN Mask */

#define MXC_F_CLCD_PALETTE_RAM_BLUE_POS                16 /**< PALETTE_RAM_BLUE Position */
#define MXC_F_CLCD_PALETTE_RAM_BLUE                    ((uint32_t)(0xFFUL << MXC_F_CLCD_PALETTE_RAM_BLUE_POS)) /**< PALETTE_RAM_BLUE Mask */

/**@} end of group CLCD_PALETTE_RAM_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_CLCD_REGS_H_
